#+TITLE: Get Things Done
#+STARTUP: overveiw
#+STARTUP: hidestars align fold nodlcheck oddeven lognotestate
#+STARTUP: logdone
#+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 3:00 4:00 8:00
#+TAGS:       Study(s) Project(p) Fix(f) Check(c) 

* Tasks
  :PROPERTIES:
  :CATEGORY: TASKS
  :END:
** WiFI Driver持续学习(mt76x2)
    SCHEDULED: <2016-08-29 周一 +1w>
*** Power Management
    - Next Action:
      Linux MT7603 STA Legacy_PSP and Fast_PSP Driver Control Flow
      V0.3
      PS Retrieve_MT7603E

*** Green AP
    - Next Action: 
      LinuxDriver Green AP - RLT MAC
      MT7603_GreenAP_Unify_MAC

*** TPUT_study
*** WoW
    - Next Action:
      WoW_MTxxxx_Intro_20141125

*** Smart Connection
    - Next Action:
      MT7687 - Smart Connection Introduction .pptx

*** USB
    - Next Action:
      usb_study_report_junqi_2_USB Driver Register.pdf

** mt7668驱动学习
    SCHEDULED: <2016-08-29 周一 +1w>
    
*** ☛ TODO [#A] Module FSM
    DEADLINE: <2016-09-30 周五>

*** ☛ TODO [#B] DBDC

*** ☛ TODO [#C] CR4 and PDMA

*** ☛ TODO [#C] HIF

*** ☛ TODO [#C] Security

*** ☛ TODO [#B] cfg80211

*** ☛ TODO [#C] Low power and WOW

*** ☛ TODO [#C] BF/MU/RA/Calibration

*** ☛ TODO [#B] FW

*** ☛ TODO [#B] P2P/TDLS

*** ☛ TODO [#C] Roaming

*** ☛ TODO [#B] SCAN
** LDD3学习 [1/5]
    SCHEDULED: <2016-08-29 周一 +1w>
*** ☛ TODO Chapter 06 Advanced Char Driver Operations
    SCHEDULED: <2016-08-25 周四>
*** ☛ TODO Chapter 14 The Linux Device Model
    SCHEDULED: <2016-08-25 周四>
*** ☛ TODO CONFIG_OF device_node
** 备忘
*** 研究在指定日期发送信息给自己的脚本
** ☛ TODO 阅读FreeMind代码，理清大体框架

** 802.11ac
   http://chimera.labs.oreilly.com/books/1234000001739/index.html
   
*** MAC层

*** 11ac中的BF
*** ☛ TODO 物理层                                                         :802.11ac学习:
** emacs
*** 工作流优化
**** ☛ TODO 任务开始时，自动计时
     参考代码：
     #+BEGIN_SRC emacs-lisp
        (setq org-log-done 'time)
          (defadvice org-clock-in (after wicked activate)
       "Mark STARTED when clocked in"
       (save-excursion
         (catch 'exit
           (org-back-to-heading t)
           (if (looking-at org-outline-regexp) (goto-char (1- (match-end 0))))
           (if (looking-at (concat " +" org-todo-regexp "\\( +\\|[ \t]*$\\)"))
               (org-todo "STARTED")))))     
     #+END_SRC
**** ☛ TODO 绽放时，显示等号的字体要同比例进行绽放
** ArchLinux学习 [1/1]
*** 了解systemd工作原理
** 技术修炼
    SCHEDULED: <2016-08-29 周一 +1w>
*** 读书计划
**** Learn More Study Less
**** 突破思维的障碍
**** 专注力
**** 一万小时天才理论
**** 成功者的大脑
**** Break-Throuhgh Rapid Reading
**** ☛ TODO The Art of Learning
     SCHEDULED: <2016-08-27 周六>
**** 提早六小时下班的高效工作术
*** 技术书箱
**** Digital Communication Systems
     http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-02-introduction-to-eecs-ii-digital-communication-systems-fall-2012/index.htm
**** ☛ TODO 计算机语言的构造与解释
     SCHEDULED: <2016-08-27 周六>
**** 编译原理（龙书）
** 编程语言捂热计划
*** 网络编程
*** C++
**** ☛ TODO 阅读C++ Concurrency in Action
**** 阅读C++编程的55个好习惯
**** cpluff
**** Google Fruit库研究
      https://github.com/google/fruit.git
*** Java
**** Guice库研究
      https://github.com/google/guice.git
**** Freemind工具研究
***** ☛ TODO 在Tab页中添加支持双击关闭的功能
*** Android
**** Android Adventures - Mastering Fragments
     http://www.i-programmer.info/ebooks/android-adventures-mastering-fragments.html
**** Android
     http://www.i-programmer.info/programming/android.html
*** Javascript
**** 学习"Javascript Data Structures - Stacks, Queue and Deque"
     http://www.i-programmer.info/programming/javascript/1674-javascript-data-structures-stacks-queues-and-deques.html
*** Python
**** 学习Python基本的网络编程方法
**** https://automatetheboringstuff.com/
** 个人开发需求
*** 编写一个Chrome Plugin，记录自己收藏的网址
*** Wifi Debug Program                                               :PROJECT:
**** 当前Action： 搭建应用程序的基本UI界面
**** WiFi
***** ☛ TODO 显示AP列表
***** ☛ TODO 连接AP
**** P2P
***** ☛ TODO 支持WiFi直连
**** Miracast
***** ☛ TODO 支持设备投屏操作
** 开源工具
   1. simple screen recoder
   2. Dia
   3. Childsplay
** 802.11常见帧格式深入研究
*** Beacon帧
    CHANNEL_SWITCH_ANNOUNCEMENT
*** CSA(Channel Switch Announcement
    eCSA
** ☛ TODO WireShark学习目标
*** Wireshark分析数据包 [0/9]
    - [ ] TCP/IP数据包
    - [ ] DNS
    - [ ] DHCP
    - [ ] WLAN 802.11
    - [ ] Chapter 29
    - [ ] Chapter 30
    - [ ] Chapter 31
    - [ ] Chapter 32
    - [ ] Chapter 33 (command tools)
** mac80211学习
*** ☛ TODO mac80211源码分析
    - Action: 制定研究计划
    - [ ] 研究hwsim源码，编写一个基于mac80211的网络驱动程序
    - [ ] 研究mac80211的源码，整理出学习笔记

** ☛ TODO [#C] IW源码学习
   - Action: 制定研究计划
** 在发送Association Request之前禁用一些HT/VHT的速率
    http://lists.infradead.org/pipermail/hostap/2015-October/034018.html

** ☛ TODO Android WiFi Framework
    制定研究计划
*** 传统WiFi流程
*** Miracast流程
*** SoftAp流程
** ☛ TODO 研究emacs源码
*** ☛ TODO org-timer源码研究
** ☛ TODO CWTS学习                                                    :Study:
CWTS学习， 内容属性简单级别
Added: [2016-08-10 周三 13:40]
** ☛ TODO  CWSP学习                                               :Study:
808.11 Security相关的知识学习
Added: [2016-08-10 周三 13:40]
** ☛ TODO  吞吐量问题分析SOP学习                                  :Study:
    SCHEDULED: <2016-08-25 周四>
TPUT_study
Added: [2016-08-10 周三 13:45]
** ☛ TODO [#C] 整理问题集                                             :Study:
    SCHEDULED: <2016-09-01 周四>
   :PROPERTIES:
   :Effort:   8:00
   :END:
将问题集写到个人知识库里面
Added: [2016-08-11 周四 17:15]
** ☛ TODO [#C] TCP-IP.Architecture.Design.and.Implementation.in.Linux.2008
    SCHEDULED: <2016-08-19 周五>
    CLOCK: [2016-08-16 周二 19:06]--[2016-08-16 周二 20:06] =>  1:00
    - [X] 第一章
    - [X] Netlink
** ☛ TODO [#C] 整理以y前的学习笔记 [4/8]
   SCHEDULED: <2016-08-29 周一 +1w>
   CLOCK: [2016-08-16 周二 11:35]--[2016-08-16 周二 11:50] =>  0:15
   CLOCK: [2016-08-16 周二 11:05]--[2016-08-16 周二 11:31] =>  0:26
   CLOCK: [2016-08-13 六 15:11]--[2016-08-13 六 15:22] =>  0:11
   :PROPERTIES:
   :Effort:   8:00
   :END:
   - [ ] Android研究文章整理
   - [X] Android学习笔记
   - [X] Android研究记录
   - [ ] CMake笔记
   - [X] C++学习笔记
   - [ ] Java编程笔记
   - [ ] Unix下C编程学习笔记
   - [X] 内核编程笔记
** ☛ TODO [#C] 处理云笔记                                             :Study:
    SCHEDULED: <2016-08-29 周一 +w>
    CLOCK: [2016-08-18 周四 18:02]--[2016-08-18 周四 18:23] =>  0:21
    CLOCK: [2016-08-18 周四 09:12]--[2016-08-18 周四 09:19] =>  0:07
    CLOCK: [2016-08-17 周三 19:25]--[2016-08-17 周三 19:40] =>  0:15

    Added: [2016-08-15 周一 13:15]

** ☛ TODO [#C] =org.el= 
    SCHEDULED: <2016-09-05 周一 +1w>
    - State "✔ DONE"     from "☛ TODO"     [2016-09-01 周四 20:55]
   CLOCK: [2016-09-01 周四 18:46]--[2016-09-01 周四 20:56] =>  2:10
   CLOCK: [2016-08-11 周四 19:32]--[2016-08-11 周四 20:36] =>  1:04
   :PROPERTIES:
   :Effort:   8:00
   :LAST_REPEAT: [2016-09-01 周四 20:57]
   :END:
   - 406行
** ☛ TODO 分析一下CUSTOMIZED_COUNTRY_REGION_CE_1修改的代码             :Study:
    SCHEDULED: <2016-08-25 周四>

Added: [2016-08-24 周三 10:50]
** ☛ TODO [#B] 设计模式学习                                           :Study:
    SCHEDULED: <2016-09-05 周一 +1w>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-29 周一 20:20]
    CLOCK: [2016-08-29 周一 19:28]--[2016-08-29 周一 20:21] =>  0:53
    CLOCK: [2016-08-15 周一 20:40]--[2016-08-15 周一 21:11] =>  0:31
    CLOCK: [2016-08-13 六 17:01]--[2016-08-13 六 17:24] =>  0:23
    CLOCK: [2016-08-13 六 16:30]--[2016-08-13 六 16:41] =>  0:11
    CLOCK: [2016-08-13 六 16:05]--[2016-08-13 六 16:30] =>  0:25
   :PROPERTIES:
   :Effort:   8:00
   :LAST_REPEAT: [2016-08-29 周一 20:21]
   :END:
    设计模式学习
    Added: [2016-08-11 周四 19:15]
** ☛ TODO [#B] 研究wpa_supplicant上的修改记录                         :Study:
    SCHEDULED: <2016-09-05 周一 +1w>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-31 周三 11:50]
    CLOCK: [2016-08-31 周三 09:45]--[2016-08-31 周三 11:50] =>  2:05
    CLOCK: [2016-08-30 周二 19:01]--[2016-08-30 周二 20:03] =>  1:02
    CLOCK: [2016-08-30 周二 17:47]--[2016-08-30 周二 18:08] =>  0:21
    - State "✔ DONE"     from "☛ TODO"     [2016-08-25 周四 17:35]
    CLOCK: [2016-08-25 周四 16:50]--[2016-08-25 周四 17:34] =>  0:44
    CLOCK: [2016-08-15 周一 17:25]--[2016-08-15 周一 18:07] =>  0:42
   :PROPERTIES:
   :Effort:   8:00
   :LAST_REPEAT: [2016-08-31 周三 11:50]
   :END:
     - 2015-October
     - Next Action: March 2009
** ☛ TODO 阅读数据通信与网络                                           :Study:
    SCHEDULED: <2016-08-31 周三>
    CLOCK: [2016-08-31 周三 17:20]--[2016-08-31 周三 18:06] =>  0:46
    - 第二部分 物理层
    - 第三部分 数据链路层
Added: [2016-08-31 周三 17:20]
** ☛ TODO 解决LDD在Linux4.7上的编译错误                                :Study:
    SCHEDULED: <2016-08-31 周三>
    - scullc
    - scullp
    - snull
    - sysfs
    - sbull
    - sculld
    - short

Added: [2016-08-31 周三 20:20]
** ☛ TODO 编写网络驱动示例程序                                        :Study:
    - 普通网络驱动
    - 基于mac80211的网络驱动
Added: [2016-08-31 周三 20:25]
** ☛ TODO 深入理解Android：Wi-Fi、NFC和GPS卷阅读计划                   :Study:
    SCHEDULED: <2016-09-02 周五>
     1. 第二章  深入理解Netd
     2. 第三章  WiFi基础知识
     3. 第四章 深入理解wpa_supplicant
     4. 第五章 深入理解WifiService
     5. 第6章 深入理解Wi-Fi Simple Configuration
     6. 第7章 深入理解Wi-Fi P2P
Added: [2016-09-02 周五 14:15]
* Calendar
  :PROPERTIES:
  :CATEGORY: CALENDAR
  :END:
* Financial
  :PROPERTIES:
  :CATEGORY: FINANCIAL
  :END:
** ☛ TODO 招商银行信用卡还款提醒
    SCHEDULED: <2016-09-27 周二 +1m>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-26 周五 19:25]
    - State "✔ DONE"     from ""           [2016-08-25 周四 13:35]
   :PROPERTIES:
   :LAST_REPEAT: [2016-08-26 周五 19:23]
   :END:

** ☛ TODO 浦发银行信用卡还款提醒
    SCHEDULED: <2016-09-30 周五 +1m>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-26 周五 19:25]
    - State "✔ DONE"     from "☛ TODO"     [2016-08-25 周四 13:40]
   :PROPERTIES:
   :LAST_REPEAT: [2016-08-26 周五 19:23]
   :END:

** ☛ TODO 广发银行信用卡还款提醒
    SCHEDULED: <2016-10-03 周一 +1m>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-26 周五 19:25]
    - State "✔ DONE"     from "☛ TODO"     [2016-08-25 周四 13:40]
   :PROPERTIES:
   :LAST_REPEAT: [2016-08-26 周五 19:23]
   :END:

** ☛ TODO 还贷提醒
    SCHEDULED: <2016-09-29 周四 +1m +2d>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-26 周五 19:25]
    - State "✔ DONE"     from "☛ TODO"     [2016-08-25 周四 13:40]
   :PROPERTIES:
   :LAST_REPEAT: [2016-08-26 周五 19:23]
   :END:
* Personal Affairs
** 老板电话
   409 886 961 319 931
** 打台湾电话
   409 886 + ...
* Projects
  :PROPERTIES:
  :CATEGORY: PROJECTS
  :END:
** 长虹
** Dajiang 
** Hisense
** TCL
** Skyworth
*** 网络拔掉后，Wifi回连时间较长
    0608

*** 项目信息
**** 联系人电话
     18575639260

**** 软件版本信息
     升级前的版本： 5.50.88058-606151-2016/05/26 16:03:59

**** KO路径
     ./system/rtk_rootfs/lib/modules/kernel/wifi/mt7662u_sta.ko

*** RD
    Neil Wu (吳宗軒)
    
** 微鲸
*** 项目信息

    | 项目                          | 说明                                  |
    |-------------------------------+---------------------------------------|
    | 智能电视平台                  | Mstar 6A828/6A938，海思 Kirin 310/510 |
    | 项目规划                      | 2016/Q4 Sample-run                    |
    | 利尔达 的微鯨PM               | 焦绍华  ( jsh@lierda.com )            |
    | 利尔达H/W &生产               | 淡江( danjiang@lierda.com )           |
    | 利尔达S/W                     | 刘新鹏 ( liuxp@lierda.com )           |
    | 微鲸商务                      | 袁寅（yuan.yin@whaley.cn）            |
    | 微鲸硬件                      | 刘立峰（liu.lifeng@whaley.cn）        |
    | 微鲸项目/软件                 | 袁磊（yuan.lei@whaley.cn）            |
    | MTK support Window for Lierda | H/W: Frank                            |
    |-------------------------------+---------------------------------------|
    
** 案例
*** p2p go dhcp failed after wlan0 linkdown
    WCNCR00082921
*** gpiolib
*** kallsyms_lookup_name() //查找对应symbol然后调用
* Daily GTD
  :PROPERTIES:
  :CATEGORY: TASKS
  :END:
** ☛ TODO [#B] 数据结构与算法设计学习                                 :Study:
    SCHEDULED: <2016-08-22 周一 +1w>
    CLOCK: [2016-08-13 六 15:24]--[2016-08-13 六 16:04] =>  0:40
   :PROPERTIES:
   :Effort:   8:00
   :END:
    数据结构与常见算法思想学习
Added: [2016-08-11 周四 13:25]

** ☛ TODO [#B] 查看公版分支上的修改                                   :Study:
    SCHEDULED: <2016-08-29 周一 +1w>
    - State "✔ DONE"     from "☛ TODO"     [2016-08-26 周五 19:10]
   :PROPERTIES:
   :Effort:   8:00
   :LAST_REPEAT: [2016-08-26 周五 19:10]
   :END:
*** Next Action: 153502
*** 待深入了解的修改：
      1. 155501   add p2p VHT 80 Draft Support
** ☛ TODO 在7662驱动中添加一个测试的虚拟接口                          :Study:
    SCHEDULED: <2016-08-25 周四>
    - 尝试在wlan0上实现softap的功能

Added: [2016-08-25 周四 09:15]
** ☛ TODO [#B] 深入了解TxRx原理
   SCHEDULED: <2016-08-27 周六>
   - [ ] 帧聚合
   - [ ] 重点研究TX流程，特别是VLAN的支持
   - [ ] TX/RX FIFO Status, TX/RX Queue Operation
   - [ ] 驱动Scan的一些行为分析

** ☛ TODO [#B] WIFI MAC TXRX
    SCHEDULED: <2016-08-31 周三> DEADLINE: <2016-09-16 周五>

** ☛ TODO [#B] 准备hostapd学习分享                                    :Study:
    SCHEDULED: <2016-09-01 周四>
    CLOCK: [2016-09-01 周四 13:47]--[2016-09-01 周四 15:47] =>  2:00
        研究P2P_GO与SoftAp的区别
        softap启动时接口的详细配置步骤(hostapd  + wifi driver))

Added: [2016-08-30 周二 17:40]
** ☛ TODO [#B] CWAP学习                                               :Study:
    SCHEDULED: <2016-08-29 周一>
    CLOCK: [2016-09-01 周四 16:56]--[2016-09-01 周四 18:02] =>  1:06
    CLOCK: [2016-09-01 周四 16:04]--[2016-09-01 周四 16:25] =>  0:21
内容属性较难级别
     - [ ] 第一章
     - [ ] 第二章
     - [ ] 第三章
     - [ ] 第四章
     - [ ] 第五章
     - [ ] 第六章
     - [ ] 第七章
     - [ ] 第八章
     - [ ] 第九章
     - [ ] 第十章
     - [ ] 第十一章
     - [ ] 第十二章

Added: [2016-08-10 周三 13:40]
** ☛ TODO [#A] v620 miracast连接断开问题                            :Project:
    SCHEDULED: <2016-09-01 周四>
     - 2016/9/1  16:55:46
       初步分析是上层主动断开的。
Added: [2016-09-01 周四 16:55]
